ELARABY-AI-Team/Main_Generator/PWM_Files/STM32F401RC_PWM.c
/***********************************************************************************************************************
* File Name      : pwm.c
* Description    : PWM driver for STM32F401RC
* Author         : Technology Inovation Software Team
* Tester         :
* Device(s)      : STM32F401RC
* Creation Date  : 2025-07-21
* Testing Date   :
* @COPYRIGHT : ELARABY GROUP-TECHNOLOGY & INNOVATION CENTER.
***********************************************************************************************************************/

#include "STM32F401RC_PWM.h"

/*
 * System Clock Frequency Assumption:
 * The STM32F401RC microcontroller can operate with a maximum HCLK of 84MHz.
 * For the purpose of this PWM implementation, it is assumed that the
 * SystemCoreClock (HCLK) is configured to 84MHz.
 *
 * Timer Clock Derivation:
 * On STM32F4 series, if the APB prescaler (APB1 or APB2) is set to 1,
 * the timer clock is equal to the APB clock. If the APB prescaler is
 * greater than 1, the timer clock is double the APB clock.
 *
 * Assuming HCLK = 84MHz:
 * - APB1 Bus (for TIM2, TIM3, TIM4, TIM5): PCLK1 is typically HCLK/2 = 42MHz.
 *   If APB1 prescaler is >1 (e.g., DIV2), then Timer Clock (CK_INT) = 2 * PCLK1 = 2 * 42MHz = 84MHz.
 * - APB2 Bus (for TIM1, TIM9, TIM10, TIM11): PCLK2 is typically HCLK = 84MHz.
 *   If APB2 prescaler is >1 (e.g., not applicable here as PCLK2 is typically HCLK),
 *   then Timer Clock (CK_INT) = PCLK2 = 84MHz.
 *
 * assumes that the effective clock frequency supplied to all timers (CK_INT) is 84 MHz.
 */
#define PWM_TIMER_CLOCK_FREQ    84000000UL /* Assumed Timer Clock Frequency based on 84MHz HCLK */

/*
 * @brief  Configuration structure for a single PWM channel.
 *         This structure maps a logical TRD_Channel_t to a specific
 *         hardware Timer, Channel, GPIO Port, Pin, and Alternate Function.
 */
typedef struct {
    TIM_TypeDef* TIMx;              /**< Pointer to the Timer peripheral base address (e.g., TIM1, TIM2) */
    uint8_t ChannelNumber;          /**< Timer channel number (1 for CH1, 2 for CH2, etc.) */
    GPIO_TypeDef* PortName;         /**< Pointer to the GPIO Port base address (e.g., GPIOA, GPIOB) */
    uint16_t PinNumber;             /**< GPIO pin mask (e.g., GPIO_PIN_0, GPIO_PIN_1, etc.) */
    uint8_t AlternateFunction;      /**< Alternate function number for the GPIO pin (e.g., GPIO_AF_TIM1) */
} PWM_Channel_Config_t;

/*
 * Reservation Logic:
 * As per the requirements, TIM5 and TIM9 are reserved for OS or delay purposes.
 * Therefore, these timers and their associated channels will not be included
 * in the pwm_channel_map array for PWM generation.
 *
 * Pin Mapping Assumptions:
 * The alternate function (AF) mapping for specific GPIO pins to TIM channels
 * is derived from common STM32F4 series datasheets and reference manuals.
 * While every effort has been made to ensure accuracy for STM32F401RC,
 * these mappings should be verified against the precise device datasheet
 * if discrepancies are observed.
 *
 * Pin Exclusion:
 * No pin with number 0 (GPIO_PIN_0) has been included unless explicitly confirmed
 * by documentation to be robustly PWM-capable and not prone to debug/reset conflicts.
 * For example, PA0 (TIM2_CH1 and TIM5_CH1) is excluded to avoid potential issues,
 * and an alternative pin (PA5 for TIM2_CH1) is used instead.
 *
 * Duplication Rule:
 * The `pwm_channel_map` array is designed such that no two entries use the
 * same timer/channel pair (e.g., TIM1, Channel 1 will only appear once).
 * However, a physical GPIO pin might be capable of multiple alternate functions
 * for different timers/channels (e.g., PA6 can be TIM3_CH1 (AF2) or TIM10_CH1 (AF3)).
 * In such cases, distinct entries in this array represent distinct `TRD_Channel_t`
 * (logical PWM outputs) that utilize different alternate functions on the same physical pin.
 */
static const PWM_Channel_Config_t pwm_channel_map[] =
{
    // TIM1 Channels (Advanced-control timer, APB2 Bus Clock, AF1)
    { TIM1, 1, GPIOA, GPIO_PIN_8,  GPIO_AF_TIM1 },  // TIM1_CH1 on PA8   /* Assumed PWM config - please verify */
    { TIM1, 2, GPIOA, GPIO_PIN_9,  GPIO_AF_TIM1 },  // TIM1_CH2 on PA9   /* Assumed PWM config - please verify */
    { TIM1, 3, GPIOA, GPIO_PIN_10, GPIO_AF_TIM1 },  // TIM1_CH3 on PA10  /* Assumed PWM config - please verify */
    { TIM1, 4, GPIOA, GPIO_PIN_11, GPIO_AF_TIM1 },  // TIM1_CH4 on PA11  /* Assumed PWM config - please verify */

    // TIM2 Channels (General-purpose timer, 32-bit, APB1 Bus Clock, AF1)
    { TIM2, 1, GPIOA, GPIO_PIN_5,  GPIO_AF_TIM2 },  // TIM2_CH1 on PA5   /* Assumed PWM config - please verify */
    { TIM2, 2, GPIOA, GPIO_PIN_1,  GPIO_AF_TIM2 },  // TIM2_CH2 on PA1   /* Assumed PWM config - please verify */
    { TIM2, 3, GPIOA, GPIO_PIN_2,  GPIO_AF_TIM2 },  // TIM2_CH3 on PA2   /* Assumed PWM config - please verify */
    { TIM2, 4, GPIOA, GPIO_PIN_3,  GPIO_AF_TIM2 },  // TIM2_CH4 on PA3   /* Assumed PWM config - please verify */

    // TIM3 Channels (General-purpose timer, 16-bit, APB1 Bus Clock, AF2)
    { TIM3, 1, GPIOA, GPIO_PIN_6,  GPIO_AF_TIM3 },  // TIM3_CH1 on PA6   /* Assumed PWM config - please verify */
    { TIM3, 2, GPIOA, GPIO_PIN_7,  GPIO_AF_TIM3 },  // TIM3_CH2 on PA7   /* Assumed PWM config - please verify */
    { TIM3, 3, GPIOB, GPIO_PIN_0,  GPIO_AF_TIM3 },  // TIM3_CH3 on PB0   /* Assumed PWM config - please verify */
    { TIM3, 4, GPIOB, GPIO_PIN_1,  GPIO_AF_TIM3 },  // TIM3_CH4 on PB1   /* Assumed PWM config - please verify */

    // TIM4 Channels (General-purpose timer, 16-bit, APB1 Bus Clock, AF2)
    { TIM4, 1, GPIOB, GPIO_PIN_6,  GPIO_AF_TIM4 },  // TIM4_CH1 on PB6   /* Assumed PWM config - please verify */
    { TIM4, 2, GPIOB, GPIO_PIN_7,  GPIO_AF_TIM4 },  // TIM4_CH2 on PB7   /* Assumed PWM config - please verify */
    { TIM4, 3, GPIOB, GPIO_PIN_8,  GPIO_AF_TIM4 },  // TIM4_CH3 on PB8   /* Assumed PWM config - please verify */
    { TIM4, 4, GPIOB, GPIO_PIN_9,  GPIO_AF_TIM4 },  // TIM4_CH4 on PB9   /* Assumed PWM config - please verify */

    // TIM10 Channel (General-purpose timer, 16-bit, APB2 Bus Clock, AF3)
    { TIM10, 1, GPIOA, GPIO_PIN_6, GPIO_AF_TIM10 }, // TIM10_CH1 on PA6  /* Assumed PWM config - please verify */

    // TIM11 Channel (General-purpose timer, 16-bit, APB2 Bus Clock, AF3)
    { TIM11, 1, GPIOA, GPIO_PIN_7, GPIO_AF_TIM11 }  // TIM11_CH1 on PA7  /* Assumed PWM config - please verify */
};

// Ensure TRD_Channel_t (PWM_CHANNEL_COUNT) in header reflects the number of entries in this array.
// For the above example, there are 18 entries, so PWM_CHANNEL_COUNT should be 18.


/**
 * @brief Enables the clock for a given GPIO port.
 * @param GPIOx Pointer to the GPIO port (e.g., GPIOA, GPIOB).
 */
static void PWM_GPIO_Clock_Enable(GPIO_TypeDef* GPIOx) {
    if (GPIOx == GPIOA) {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN; /* PDF Reference - Assumed RCC register bit for GPIOA */
    } else if (GPIOx == GPIOB) {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN; /* PDF Reference - Assumed RCC register bit for GPIOB */
    } else if (GPIOx == GPIOC) {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN; /* PDF Reference - Assumed RCC register bit for GPIOC */
    } else if (GPIOx == GPIOD) {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN; /* PDF Reference - Assumed RCC register bit for GPIOD */
    }
    // Ports F, G, H, I, J, K are not available in STM32F401xB/C/D/E (RM0368 Rev 5, page 146).
    // Small delay for clock to stabilize (read back to ensure clock is stable)
    (void)RCC->AHB1ENR;
}

/**
 * @brief Disables the clock for a given GPIO port.
 * @param GPIOx Pointer to the GPIO port (e.g., GPIOA, GPIOB).
 */
static void PWM_GPIO_Clock_Disable(GPIO_TypeDef* GPIOx) {
    if (GPIOx == GPIOA) {
        RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOAEN; /* PDF Reference - Assumed RCC register bit for GPIOA */
    } else if (GPIOx == GPIOB) {
        RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOBEN; /* PDF Reference - Assumed RCC register bit for GPIOB */
    } else if (GPIOx == GPIOC) {
        RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOCEN; /* PDF Reference - Assumed RCC register bit for GPIOC */
    } else if (GPIOx == GPIOD) {
        RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIODEN; /* PDF Reference - Assumed RCC register bit for GPIOD */
    }
}

/**
 * @brief Enables the clock for a given Timer peripheral.
 * @param TIMx Pointer to the Timer peripheral base address (e.g., TIM1, TIM2).
 */
static void PWM_Timer_Clock_Enable(TIM_TypeDef* TIMx) {
    if (TIMx == TIM1) {
        RCC->APB2ENR |= RCC_APB2ENR_TIM1EN; /* PDF Reference - Assumed RCC register bit for TIM1 */
    } else if (TIMx == TIM2) {
        RCC->APB1ENR |= RCC_APB1ENR_TIM2EN; /* PDF Reference - Assumed RCC register bit for TIM2 */
    } else if (TIMx == TIM3) {
        RCC->APB1ENR |= RCC_APB1ENR_TIM3EN; /* PDF Reference - Assumed RCC register bit for TIM3 */
    } else if (TIMx == TIM4) {
        RCC->APB1ENR |= RCC_APB1ENR_TIM4EN; /* PDF Reference - Assumed RCC register bit for TIM4 */
    } else if (TIMx == TIM10) {
        RCC->APB2ENR |= RCC_APB2ENR_TIM10EN; /* PDF Reference - Assumed RCC register bit for TIM10 */
    } else if (TIMx == TIM11) {
        RCC->APB2ENR |= RCC_APB2ENR_TIM11EN; /* PDF Reference - Assumed RCC register bit for TIM11 */
    }
    // Reserved timers TIM5, TIM9 are not enabled here.
    // Small delay for clock to stabilize
    (void)TIMx->CR1;
}

/**
 * @brief Disables the clock for a given Timer peripheral.
 * @param TIMx Pointer to the Timer peripheral base address (e.g., TIM1, TIM2).
 */
static void PWM_Timer_Clock_Disable(TIM_TypeDef* TIMx) {
    if (TIMx == TIM1) {
        RCC->APB2ENR &= ~RCC_APB2ENR_TIM1EN; /* PDF Reference - Assumed RCC register bit for TIM1 */
    } else if (TIMx == TIM2) {
        RCC->APB1ENR &= ~RCC_APB1ENR_TIM2EN; /* PDF Reference - Assumed RCC register bit for TIM2 */
    } else if (TIMx == TIM3) {
        RCC->APB1ENR &= ~RCC_APB1ENR_TIM3EN; /* PDF Reference - Assumed RCC register bit for TIM3 */
    } else if (TIMx == TIM4) {
        RCC->APB1ENR &= ~RCC_APB1ENR_TIM4EN; /* PDF Reference - Assumed RCC register bit for TIM4 */
    } else if (TIMx == TIM10) {
        RCC->APB2ENR &= ~RCC_APB2ENR_TIM10EN; /* PDF Reference - Assumed RCC register bit for TIM10 */
    } else if (TIMx == TIM11) {
        RCC->APB2ENR &= ~RCC_APB2ENR_TIM11EN; /* PDF Reference - Assumed RCC register bit for TIM11 */
    }
}

/**
 * @brief Configures a GPIO pin for Alternate Function mode.
 * @param GPIOx Pointer to the GPIO Port base address.
 * @param PinMask GPIO pin mask (e.g., GPIO_PIN_0, GPIO_PIN_1, etc.).
 * @param AF Alternate function number for the GPIO pin.
 */
static void PWM_GPIO_Init(GPIO_TypeDef* GPIOx, uint16_t PinMask, uint8_t AF) {
    // Enable GPIO Port Clock
    PWM_GPIO_Clock_Enable(GPIOx);

