ELARABY-AI-Team/Main_Generator/PWM_Files/STM32F401RC_PWM.c
    uint32_t pin_pos = 0;
    // Determine the bit position (0-15) from the PinMask
    // This loop or __builtin_ctz (count trailing zeros) can be used.
    // Assuming PinMask is a single bit (e.g., 0x0001, 0x0002, ...)
    while (((PinMask >> pin_pos) & 0x1) == 0 && pin_pos < 16) {
        pin_pos++;
    }
    if (pin_pos >= 16) {
        // Invalid pin mask, or no pin found
        return;
    }

    // Configure GPIO Pin in Alternate Function mode (MODER)
    // MODER bits are 2y:2y+1 for pin y. Set to 10 (Alternate function mode).
    GPIOx->MODER &= ~(0x3UL << (pin_pos * 2)); // Clear current mode bits
    GPIOx->MODER |= (0x2UL << (pin_pos * 2));  // Set to Alternate Function mode (10) /* PDF Reference - Table 24, MODER bits to 10 for AF */

    // Configure Output type to Push-Pull (OTYPER)
    // OTYPER bit y for pin y. Set to 0 (Push-pull).
    GPIOx->OTYPER &= ~(0x1UL << pin_pos);      // Set to Push-pull (0) /* PDF Reference - Table 24, OTYPER bit to 0 for Push-pull */

    // Configure Output Speed to High speed (OSPEEDR)
    // OSPEEDR bits are 2y:2y+1 for pin y. Set to 10 (High speed).
    GPIOx->OSPEEDR &= ~(0x3UL << (pin_pos * 2)); // Clear current speed bits
    GPIOx->OSPEEDR |= (0x2UL << (pin_pos * 2));  // Set to High speed (10) /* PDF Reference - Table 24, OSPEEDR bits to 10 for High speed */

    // Configure Pull-up/Pull-down to No pull-up, pull-down (PUPDR)
    // PUPDR bits are 2y:2y+1 for pin y. Set to 00 (No pull-up, pull-down).
    GPIOx->PUPDR &= ~(0x3UL << (pin_pos * 2)); // Set to No Pull-up/Pull-down (00) /* PDF Reference - Table 24, PUPDR bits to 00 for No pull */

    // Configure Alternate Function (AFRL for pins 0-7, AFRH for pins 8-15)
    // AFRLy/AFRHy are 4 bits each.
    if (pin_pos < 8) {
        GPIOx->AFR[0] &= ~(0xFUL << (pin_pos * 4));     // Clear 4 bits for the AF selection
        GPIOx->AFR[0] |= ((uint32_t)AF << (pin_pos * 4)); /* PDF Reference - GPIOx_AFRL register */
    } else {
        GPIOx->AFR[1] &= ~(0xFUL << ((pin_pos - 8) * 4)); // Clear 4 bits for the AF selection
        GPIOx->AFR[1] |= ((uint32_t)AF << ((pin_pos - 8) * 4)); /* PDF Reference - GPIOx_AFRH register */
    }
}


/**
 * @brief Initializes the PWM hardware and configures the timer and GPIOs for the given channel.
 * @param TRD_Channel The specific PWM channel to initialize (index into pwm_channel_map).
 */
void PWM_Init(TRD_Channel_t TRD_Channel) {
    // Validate TRD_Channel against the size of the pwm_channel_map array
    if (TRD_Channel >= (TRD_Channel_t)(sizeof(pwm_channel_map) / sizeof(pwm_channel_map[0]))) {
        // Invalid channel, return or handle error appropriately
        return;
    }

    const PWM_Channel_Config_t* config = &pwm_channel_map[TRD_Channel];

    // 1. Initialize GPIO for the PWM channel
    PWM_GPIO_Init(config->PortName, config->PinNumber, config->AlternateFunction);

    // 2. Enable Timer Peripheral Clock
    PWM_Timer_Clock_Enable(config->TIMx);

    // 3. Configure Timer Time-base (Prescaler and Auto-Reload Register)
    // Disable the counter to allow configuration
    config->TIMx->CR1 &= ~TIM_CR1_CEN; /* PDF Reference - TIMx_CR1, CEN bit */

    // Enable Auto-Reload Preload Register (ARPE) for buffered updates.
    // This ensures that ARR changes take effect only after an update event (UG bit set in EGR).
    config->TIMx->CR1 |= TIM_CR1_ARPE; /* PDF Reference - TIMx_CR1, ARPE bit for buffered ARR updates */

    // Set a default prescaler and ARR for a starting frequency.
    // For 84MHz timer clock, PSC=83 gives 1MHz counter clock.
    // Then ARR=99 gives 10kHz frequency (1MHz / (99+1) = 10kHz).
    config->TIMx->PSC = 83; /* PDF Reference - TIMx_PSC register. Assumed value for 1MHz counter clock. */
    config->TIMx->ARR = 99; /* PDF Reference - TIMx_ARR register. Assumed value for 10kHz default frequency. */

    // Clear the counter
    config->TIMx->CNT = 0; /* PDF Reference - TIMx_CNT register */

    // 4. Configure Output Compare Mode (PWM Mode 1)
    // Clear CCxS bits (00 for output) and set OCxM (110 for PWM Mode 1), OCxPE (1 for preload enable)
    volatile uint32_t* ccmr_reg = NULL;
    uint32_t ccmr_clear_mask = 0;
    uint32_t ccmr_set_val = 0;

    // Positions for OCxM, OCxPE, CCxS differ based on channel number for CCMR1/CCMR2
    uint32_t oc_mode_pos; // Position of OCxM bits
    uint32_t oc_pe_pos;   // Position of OCxPE bit
    uint32_t cc_s_pos;    // Position of CCxS bits

    if (config->ChannelNumber == 1) {
        ccmr_reg = &config->TIMx->CCMR1;
        oc_mode_pos = TIM_CCMR1_OC1M_Pos; // Bits 6:4
        oc_pe_pos = TIM_CCMR1_OC1PE_Pos;   // Bit 3
        cc_s_pos = TIM_CCMR1_CC1S_Pos;     // Bits 1:0
    } else if (config->ChannelNumber == 2) {
        ccmr_reg = &config->TIMx->CCMR1;
        oc_mode_pos = TIM_CCMR1_OC2M_Pos; // Bits 14:12
        oc_pe_pos = TIM_CCMR1_OC2PE_Pos;   // Bit 11
        cc_s_pos = TIM_CCMR1_CC2S_Pos;     // Bits 9:8
    } else if (config->ChannelNumber == 3) {
        ccmr_reg = &config->TIMx->CCMR2;
        oc_mode_pos = TIM_CCMR2_OC3M_Pos; // Bits 6:4
        oc_pe_pos = TIM_CCMR2_OC3PE_Pos;   // Bit 3
        cc_s_pos = TIM_CCMR2_CC3S_Pos;     // Bits 1:0
    } else if (config->ChannelNumber == 4) {
        ccmr_reg = &config->TIMx->CCMR2;
        oc_mode_pos = TIM_CCMR2_OC4M_Pos; // Bits 14:12
        oc_pe_pos = TIM_CCMR2_OC4PE_Pos;   // Bit 11
        cc_s_pos = TIM_CCMR2_CC4S_Pos;     // Bits 9:8
    } else {
        return; // Invalid channel number for a timer
    }

    // Clear CCxS (00 for output), OCxM and OCxPE bits
    ccmr_clear_mask = (0x3UL << cc_s_pos) | (0x7UL << oc_mode_pos) | (0x1UL << oc_pe_pos);
    // Set OCxM to PWM Mode 1 (110 = 0x6), and enable preload (OCxPE = 1)
    ccmr_set_val = (0x6UL << oc_mode_pos) | (0x1UL << oc_pe_pos); /* PDF Reference - OCxM=110, OCxPE=1 */

    *ccmr_reg &= ~ccmr_clear_mask;
    *ccmr_reg |= ccmr_set_val;

    // 5. Configure Capture/Compare Enable Register (CCER)
    // Set CCxE to 1 (Output enable), CCxP to 0 (Active high)
    // CCxP and CCxE bits are located at (channel_number - 1) * 4
    uint32_t ccer_channel_offset = (config->ChannelNumber - 1) * 4;
    // Clear CCxP and CCxE bits for the current channel
    config->TIMx->CCER &= ~( (TIM_CCER_CC1P | TIM_CCER_CC1E) << ccer_channel_offset ); /* PDF Reference - TIMx_CCER bits */
    // Set CCxE (output enable) - CCxP (polarity) remains 0 (active high) after clear.
    config->TIMx->CCER |= (TIM_CCER_CC1E << ccer_channel_offset); /* PDF Reference - CCxE=1, CCxP=0 (default) */


