ELARABY-AI-Team/Main_Generator/PWM_Files/STM32F401RC_PWM.c
    // 6. For advanced-control timers (TIM1), enable Main Output (MOE)
    if (config->TIMx == TIM1) {
        config->TIMx->BDTR |= TIM_BDTR_MOE; /* PDF Reference - TIMx_BDTR, MOE bit */
    }

    // 7. Generate an update event to load the preload registers (PSC, ARR, CCR, OCxM, OCxPE) into active registers
    // This also clears the counter and prescaler, ensuring configuration takes effect.
    config->TIMx->EGR |= TIM_EGR_UG; /* PDF Reference - TIMx_EGR, UG bit */
}


/**
 * @brief Sets the desired PWM frequency and duty cycle for the selected channel.
 * @param TRD_Channel The specific PWM channel to configure.
 * @param frequency The desired PWM frequency in Hz.
 * @param duty The desired duty cycle in percentage (0-100).
 */
void PWM_Set_Freq(TRD_Channel_t TRD_Channel, tlong frequency, tbyte duty) {
    // Validate TRD_Channel
    if (TRD_Channel >= (TRD_Channel_t)(sizeof(pwm_channel_map) / sizeof(pwm_channel_map[0]))) {
        return; // Invalid channel
    }
    // Validate input parameters
    if (frequency == 0 || duty > 100) {
        return; // Invalid frequency or duty cycle
    }

    const PWM_Channel_Config_t* config = &pwm_channel_map[TRD_Channel];

    // Determine max ARR based on timer type (16-bit or 32-bit)
    uint32_t max_arr_val = 0xFFFF; // Default for 16-bit timers (TIM1, TIM3, TIM4, TIM10, TIM11)
    if (config->TIMx == TIM2) { // TIM2 is 32-bit
        max_arr_val = 0xFFFFFFFF;
    }
    // TIM5 is reserved, but if it were used it would also be 32-bit.

    uint32_t psc = 0;
    uint32_t arr = 0;
    uint64_t timer_clk_div_freq = 0; // Use 64-bit for intermediate calculations to prevent overflow

    // Aim for a resolution of at least 100 steps for duty cycle, or higher if frequency allows.
    // Optimal strategy: Keep PSC as small as possible to maximize ARR for resolution.
    // Iteratively find PSC and ARR: (PSC + 1) * (ARR + 1) = PWM_TIMER_CLOCK_FREQ / frequency
    // Start with minimum PSC (0) and calculate max ARR possible.
    // If ARR exceeds max_arr_val, increase PSC and re-calculate.
    for (psc = 0; psc <= 0xFFFF; psc++) { // PSC is 16-bit
        if (frequency == 0) continue; // Avoid division by zero if frequency becomes 0 during loop
        timer_clk_div_freq = PWM_TIMER_CLOCK_FREQ / frequency;
        // Calculate (ARR + 1)
        uint64_t arr_plus_1 = timer_clk_div_freq / (psc + 1);

        if (arr_plus_1 > 0 && arr_plus_1 <= (max_arr_val + 1)) {
            arr = (uint32_t)(arr_plus_1 - 1);
            if (arr > 0) { // ARR cannot be 0 for PWM generation.
                break; // Found suitable PSC and ARR values
            }
        }
    }

    // If no suitable PSC/ARR pair found within the 16-bit PSC range
    if (psc > 0xFFFF) {
        // Frequency cannot be achieved with the given timer clock and resolution.
        return;
    }

    // Stop the timer counter temporarily during configuration update
    config->TIMx->CR1 &= ~TIM_CR1_CEN; /* PDF Reference - TIMx_CR1, CEN bit */

    // Set the calculated Prescaler and Auto-Reload Register values
    config->TIMx->PSC = psc; /* PDF Reference - TIMx_PSC register */
    config->TIMx->ARR = arr; /* PDF Reference - TIMx_ARR register */

    // Calculate Capture Compare Register value for duty cycle
    // CCRx = (ARR + 1) * duty / 100
    uint32_t ccr_val = (uint32_t)(((uint64_t)(arr + 1) * duty) / 100);
    // Ensure CCR value does not exceed ARR
    if (ccr_val > arr) {
        ccr_val = arr;
    }

    // Set the Capture Compare Register value for the specific channel
    switch (config->ChannelNumber) {
        case 1:
            config->TIMx->CCR1 = ccr_val; /* PDF Reference - TIMx_CCR1 register */
            break;
        case 2:
            config->TIMx->CCR2 = ccr_val; /* PDF Reference - TIMx_CCR2 register */
            break;
        case 3:
            config->TIMx->CCR3 = ccr_val; /* PDF Reference - TIMx_CCR3 register */
            break;
        case 4:
            config->TIMx->CCR4 = ccr_val; /* PDF Reference - TIMx_CCR4 register */
            break;
        default:
            break; // Should not happen with validation above
    }

    // Generate an update event to load the new values from preload registers into active registers
    config->TIMx->EGR |= TIM_EGR_UG; /* PDF Reference - TIMx_EGR, UG bit */

    // Restart the counter
    config->TIMx->CR1 |= TIM_CR1_CEN; /* PDF Reference - TIMx_CR1, CEN bit */
}

/**
 * @brief Enables and starts PWM signal generation on the specified channel.
 * @param TRD_Channel The specific PWM channel to start.
 */
void PWM_Start(TRD_Channel_t TRD_Channel) {
    if (TRD_Channel >= (TRD_Channel_t)(sizeof(pwm_channel_map) / sizeof(pwm_channel_map[0]))) {
        return; // Invalid channel
    }

    const PWM_Channel_Config_t* config = &pwm_channel_map[TRD_Channel];

    // Enable the output compare channel (CCxE bit)
    uint32_t ccer_channel_offset = (config->ChannelNumber - 1) * 4;
    config->TIMx->CCER |= (TIM_CCER_CC1E << ccer_channel_offset); /* PDF Reference - TIMx_CCER, CCxE bit */

    // For advanced-control timers (TIM1), ensure Main Output (MOE) is enabled
    // This allows the outputs OCx and OCxN to be driven.
    if (config->TIMx == TIM1) {
        config->TIMx->BDTR |= TIM_BDTR_MOE; /* PDF Reference - TIMx_BDTR, MOE bit */
    }

    // Enable the timer counter (CEN bit)
    config->TIMx->CR1 |= TIM_CR1_CEN; /* PDF Reference - TIMx_CR1, CEN bit */
}

/**
 * @brief Stops the PWM signal output on the specified channel.
 * @param TRD_Channel The specific PWM channel to stop.
 */
void PWM_Stop(TRD_Channel_t TRD_Channel) {
    if (TRD_Channel >= (TRD_Channel_t)(sizeof(pwm_channel_map) / sizeof(pwm_channel_map[0]))) {
        return; // Invalid channel
    }

    const PWM_Channel_Config_t* config = &pwm_channel_map[TRD_Channel];

    // Disable the output compare channel (CCxE bit)
    uint32_t ccer_channel_offset = (config->ChannelNumber - 1) * 4;
    config->TIMx->CCER &= ~(TIM_CCER_CC1E << ccer_channel_offset); /* PDF Reference - TIMx_CCER, CCxE bit */

    // For advanced-control timers (TIM1), disable Main Output (MOE)
    if (config->TIMx == TIM1) {
        config->TIMx->BDTR &= ~TIM_BDTR_MOE; /* PDF Reference - TIMx_BDTR, MOE bit */
    }
    // Note: The timer counter (CEN bit) is not stopped here,
    // as other channels on the same timer might still be active.
    // The output is effectively stopped by disabling CCxE and MOE.
}

/**
 * @brief Disables all PWM peripherals and outputs to reduce power consumption.
 *        This function iterates through all defined PWM channels in pwm_channel_map,
 *        disables their outputs, resets their GPIOs to input floating mode,
 *        and disables the associated timer and GPIO clocks.
 *        It assumes a complete power-off of the PWM module is desired.
 */
void PWM_PowerOff(void) {
    // Iterate through all possible PWM configurations and disable them
    for (TRD_Channel_t i = (TRD_Channel_t)0; i < (TRD_Channel_t)(sizeof(pwm_channel_map) / sizeof(pwm_channel_map[0])); i++) {
        const PWM_Channel_Config_t* config = &pwm_channel_map[i];

        // 1. Stop the specific channel output
        PWM_Stop(i); // This clears CCxE for the channel and MOE (for TIM1)

        // 2. Reset the timer counter and disable it
        config->TIMx->CNT = 0;             /* PDF Reference - TIMx_CNT register */
        config->TIMx->CR1 &= ~TIM_CR1_CEN; /* PDF Reference - TIMx_CR1, CEN bit */
        // Also clear ARPE bit as part of power-off / reset
        config->TIMx->CR1 &= ~TIM_CR1_ARPE; /* Clear ARPE bit */


        // 3. Reset GPIO pin to Input Floating mode (MODER 00) and no pull-up/down
        uint32_t pin_pos = 0;
        uint16_t pin_mask = config->PinNumber;
        while (((pin_mask >> pin_pos) & 0x1) == 0 && pin_pos < 16) {
            pin_pos++;
        }
        if (pin_pos < 16) {
            config->PortName->MODER &= ~(0x3UL << (pin_pos * 2)); // Set to 00 (Input mode) /* PDF Reference - Table 24, MODER bits to 00 for Input */
            config->PortName->PUPDR &= ~(0x3UL << (pin_pos * 2)); // Set to 00 (No pull-up, pull-down) /* PDF Reference - Table 24, PUPDR bits to 00 */
            // Reset alternate function to 0 as well
            if (pin_pos < 8) {
                config->PortName->AFR[0] &= ~(0xFUL << (pin_pos * 4));
            } else {
                config->PortName->AFR[1] &= ~(0xFUL << ((pin_pos - 8) * 4));
            }
        }
    }

    // 4. Disable clocks for all GPIOs and Timers used in the pwm_channel_map.
    // This part is less efficient if many channels share the same peripheral clock.
    // A more optimized approach would use a flag/counter for each peripheral to track usage.
    // However, for a full "PowerOff" function, explicitly disabling all used clocks is acceptable.
    // Only disable clocks for GPIO ports explicitly listed in pwm_channel_map.
    PWM_GPIO_Clock_Disable(GPIOA);
    PWM_GPIO_Clock_Disable(GPIOB);
    // GPIOC and GPIOD are not used by the current pwm_channel_map, so disabling their clocks here is redundant
    // PWM_GPIO_Clock_Disable(GPIOC);
    // PWM_GPIO_Clock_Disable(GPIOD);

    // Only disable clocks for timers explicitly listed in pwm_channel_map.
    PWM_Timer_Clock_Disable(TIM1);
    PWM_Timer_Clock_Disable(TIM2);
    PWM_Timer_Clock_Disable(TIM3);
    PWM_Timer_Clock_Disable(TIM4);
    PWM_Timer_Clock_Disable(TIM10);
    PWM_Timer_Clock_Disable(TIM11);
    // Reserved timers TIM5, TIM9 are not affected by this driver's power off, assuming
    // they are managed by other system components.
}